//
//  DataManager.swift
//  BoardGame
//
//  Created by Владислав Голосов on 12.02.2022.
//

class BoardGame {
    
    static let shared = BoardGame()

    let titles = [
        "Покорение Марса",
        "Брасс Бирмингем",
        "Пять племён",
        "На Марсе",
        "Лиссабон"
    ]
    
    let description = [
        """
            В 2400-х человечество начинает терраформировать планету Марс. Гигантские корпорации, созданные по инициативе Всемирного правительства на Земле, инициируют масштабные проекты, чтобы поднять температуру, уровень кислорода и покрыть океанами планету Марс до условий, пригодных для жизни. В Terraforming Mars вы играете за одну из этих корпораций и работаете вместе в процессе терраформирования, но конкурируете за получение победных очков, которыми награждаетесь не только за вклад в терраформинг, но и за развитие человеческой инфраструктуры во всей Солнечной системе.
        """,
        """
            "Брасс Бирмингем" — это история о конкурирующих предпринимателях в период английской промышленной революции в 1770—1870 годах. Мидленс — регион в центральной части Англии. Именно здесь находились главные угольные шахты. Промышленная агломерация была сосредоточена вокруг города Бирмингема. За угольные месторождения и дым заводских труб её прозвали Чёрной страной.
        """,
        """
            Бруно Катала взял за основу механику древней игры «Манкала» (или «Калах»), добавил к ней механику сбора сетов, создал модульное поле и пять племён, каждое из которых действует по собственным правилам, и умудрился органично соединить все части в семейную стратегию и не перегрузить её.
            Вы выступите в роли чужеземца, желающего завладеть троном легендарного государства Накала. Для победы вам нужно завладеть богатствами султаната и обрести наибольшее влияние: в конце игры победные очки принесёт каждая монета, визирь или старейшина, а также каждый регион, который вы захватили.
        """,
        """
            "На Марсе" – это настольная игра, где участникам предстоит исследовать планету, добывать ресурсы, строить, снабжать энергией и перестраивать постройки, а также конструировать марсоходы и космические корабли.
        """,
        """
            "Лиссабон" - это игра о восстановлении Лиссабона после Великого лиссабонского землетрясения, произошедшего 1 ноября 1755 года. Вслед за сейсмическими толчками магнитудой 8,5-9,0 баллов, на город обрушилось цунами, после чего трёхдневный пожар завершил практически полное уничтожение столицы Португалии. Маркиз ди Помбал, Себастьян Жозе Помбал, бывший в то время Министром иностранных дел, был назначен королём возглавить работы по восстановлению города.
        """
    ]
    
    
}
